AccumulationRegisters/ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРПоСуммарномуТарифу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРДоПредельнойВеличины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРСПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРСтраховая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРНакопительная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФСС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФФОМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТФОМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРНаДоплатуЛетчикам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРНаДоплатуШахтерам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФССНесчастныеСлучаи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВзносыПоЕдиномуТарифу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ООСМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОППВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОПВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОблагаетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияОплатыТрудаДляНУ</Name>
					<Comment>Вид начисления для налогового учета по налогу на прибыль</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийОплатыТрудаДляНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПринятияРасходов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВСтруктуреПредприятия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МестоВСтруктуреПредприятия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОтражениеВБухучетеНачисленныйНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОтражениеВБухучетеНачисленныйНДФЛ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОтражениеВБухучетеУдержанныйНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОтражениеВБухучетеУдержанныйНДФЛ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПеречисленияНалога</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ОтражениеРасчетовЗарплатыВБухучете/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура предназначена для формирования движений регистрам подсистемы.
//
// Параметры:
//	Движения - Коллекция движений документа. 
//	Отказ - Булево - признак отказа от проведения документа.
//	Организация - СправочникСсылка.Организация - организация.
//	МесяцНачисления - Дата - месяц, зарплата которого отражается в бухучете.
//	ДанныеДляОтражения - Структура - Таблицы значений с данными, которые 
//						использоваться для формирования движений.
//
Процедура СформироватьДвижения(Движения, Отказ, Организация, МесяцНачисления, ДанныеДляОтражения) Экспорт
	
	Если ДанныеДляОтражения.Свойство("НачисленнаяЗарплатаИВзносы") Тогда
		Для каждого СтрокаТЗ Из ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы Цикл
			НоваяСтрока = Движения.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.Период = МесяцНачисления;
			Движения.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.Записывать = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеДляОтражения.Свойство("НачисленныйНДФЛ") Тогда
		Для каждого СтрокаТЗ Из ДанныеДляОтражения.НачисленныйНДФЛ Цикл
			НоваяСтрока = Движения.ОтражениеВБухучетеНачисленныйНДФЛ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.Период = МесяцНачисления;
			Движения.ОтражениеВБухучетеНачисленныйНДФЛ.Записывать = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеДляОтражения.Свойство("УдержаннаяЗарплата") Тогда
		Для каждого СтрокаТЗ Из ДанныеДляОтражения.УдержаннаяЗарплата Цикл
			НоваяСтрока = Движения.ОтражениеВБухучетеУдержаннаяЗарплата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.Период = МесяцНачисления;
			Движения.ОтражениеВБухучетеУдержаннаяЗарплата.Записывать = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеДляОтражения.Свойство("ВыплатаЗаСчетРезерва") Тогда
		
		Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(ДанныеДляОтражения.ВыплатаЗаСчетРезерва, "Сотрудник", Истина);
		СотрудникФизическиеЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники,"ФизическоеЛицо");
		Для каждого СтрокаТЗ Из ДанныеДляОтражения.ВыплатаЗаСчетРезерва Цикл
			НоваяСтрока = Движения.ОтражениеВБухучетеВыплатаЗаСчетРезерва.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.Период = МесяцНачисления;
			НоваяСтрока.ФизическоеЛицо = СотрудникФизическиеЛица[НоваяСтрока.Сотрудник];
			Движения.ОтражениеВБухучетеВыплатаЗаСчетРезерва.Записывать = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДанныеДляОтражения.Свойство("УдержанныйНДФЛ") Тогда
		Для каждого СтрокаТЗ Из ДанныеДляОтражения.УдержанныйНДФЛ Цикл
			НоваяСтрока = Движения.ОтражениеВБухучетеУдержанныйНДФЛ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.Период = МесяцНачисления;
			Движения.ОтражениеВБухучетеУдержанныйНДФЛ.Записывать = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Удаляет из результатов заполнения строки, которые не относятся к выбранным параметрам заполнения,
// и данные, которые уже отражены в бухучете.
//
//	Параметры
//		РезультатЗаполнения - Структура - описание см. ОтражениеЗарплатыВБухучете.НоваяСтруктураДанныеДляОтраженияЗарплатыВБухучете.
//		ПараметрыДляЗаполнения - Структура - описание см. ОтражениеЗарплатыВБухучетеРасширенный.ПараметрыДляЗаполненияТаблицДокумента.
//
Процедура ОтобратьРезультатыЗаполненияТаблицДокумента(РезультатЗаполнения, ПараметрыДляЗаполнения) Экспорт
	
	Организация 	 		= ПараметрыДляЗаполнения.Организация;
	ПериодРегистрации 		= ПараметрыДляЗаполнения.ПериодРегистрации;
	ИсключаемыйРегистратор 	= ПараметрыДляЗаполнения.ДокументСсылка;
	
	Подразделение = Неопределено;
	ПараметрыДляЗаполнения.Свойство("Подразделение", Подразделение);
	
	СтатьиФинансирования = Неопределено;
	ПараметрыДляЗаполнения.Свойство("СтатьиФинансирования", СтатьиФинансирования);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	ШаблонТекстаЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Таблица.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	#ИмяТаблицы КАК Таблица
	|ГДЕ
	|	Таблица.Организация = &Организация
	|	И Таблица.Период = &ПериодРегистрации
	|	И Таблица.Регистратор <> &ИсключаемыйРегистратор";
	
	Первый = Истина;
	Для каждого ЭлементКоллекции Из РезультатЗаполнения Цикл
        // ЗУПК
		Если ВРег(ЭлементКоллекции.Ключ) = ВРег("РегламентированныеУдержания") 
			ИЛИ ВРег(ЭлементКоллекции.Ключ) = ВРег("ПеняПоВзносамИОтчислениям") Тогда
			ИмяТаблицы = ЭлементКоллекции.Ключ;
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,"#ИмяТаблицы КАК Таблица","Документ.ОтражениеЗарплатыВБухучете." + ИмяТаблицы + " КАК Таблица 
															|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВБухучете КАК ОтражениеЗарплатыВБухучете
															|	ПО Таблица.Ссылка = ОтражениеЗарплатыВБухучете.Ссылка
															|		И ОтражениеЗарплатыВБухучете.Проведен");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Таблица.Организация","Таблица.Ссылка.Организация");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Таблица.Период","Таблица.Ссылка.ПериодРегистрации");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Таблица.Регистратор","Таблица.Ссылка");
			Если Первый Тогда
				Запрос.Текст = ТекстЗапроса;
				Первый = Ложь;
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РАЗРЕШЕННЫЕ", "");
				Запрос.Текст = Запрос.Текст + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|" + ТекстЗапроса;
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		// ЗУПК
		ИмяТаблицы = ЭлементКоллекции.Ключ;
		ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,"#ИмяТаблицы","РегистрНакопления.ОтражениеВБухучете"+ИмяТаблицы);
		Если Первый Тогда
			Запрос.Текст = ТекстЗапроса;
			Первый = Ложь;
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РАЗРЕШЕННЫЕ", "");
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + ТекстЗапроса;
		КонецЕсли;
	КонецЦикла;
	РезультатЗапроса = Запрос.Выполнить();
	
	ВычестьУжеЗарегистрированныеДанные = Не РезультатЗапроса.Пустой();
	
	Если Не ВычестьУжеЗарегистрированныеДанные И Не ЗначениеЗаполнено(Подразделение) И Не ЗначениеЗаполнено(СтатьиФинансирования) Тогда
		ОтражениеЗарплатыВБухучете.СвернутьДанныеДляОтраженияЗарплатыВБухучете(РезультатЗаполнения, "");
		Возврат;
	КонецЕсли;
	
	Если ВычестьУжеЗарегистрированныеДанные Тогда
		
		ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.ИмяПоля КАК ИмяПоля
		|ИЗ
		|	#БухучетТаблица КАК Таблица
		|ГДЕ
		|	Таблица.Организация = &Организация
		|	И Таблица.Период = &ПериодРегистрации
		|	И Таблица.Регистратор <> &ИсключаемыйРегистратор";
		
		Для каждого ЭлементКоллекции Из РезультатЗаполнения Цикл
		
			ИмяТаблицы 	= ЭлементКоллекции.Ключ;
			Таблица 	= ЭлементКоллекции.Значение;
			
			ПоляЗапроса = Новый Массив;
			Для каждого КолонкаТЗ Из Таблица.Колонки Цикл
				ИмяПоля = КолонкаТЗ.Имя;
				Если КолонкаТЗ.ТипЗначения.СодержитТип(Тип("Число")) Тогда
					ПоляЗапроса.Добавить("-Таблица." + ИмяПоля + " КАК " + ИмяПоля);
				Иначе
					ПоляЗапроса.Добавить("Таблица." + ИмяПоля + " КАК " + ИмяПоля);
				КонецЕсли;
			КонецЦикла;
			ПоляЗапроса = СтрСоединить(ПоляЗапроса, "," + Символы.ПС);
			
			ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,"Таблица.ИмяПоля КАК ИмяПоля",ПоляЗапроса);
			// ЗУПК
			Если ВРег(ЭлементКоллекции.Ключ) = ВРег("РегламентированныеУдержания") 
				ИЛИ ВРег(ЭлементКоллекции.Ключ) = ВРег("ПеняПоВзносамИОтчислениям") Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#БухучетТаблица","Документ.ОтражениеЗарплатыВБухучете."+ИмяТаблицы);
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Таблица.Организация","Таблица.Ссылка.Организация");
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Таблица.Период","Таблица.Ссылка.ПериодРегистрации");
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Таблица.Регистратор","Таблица.Ссылка");
            Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#БухучетТаблица","РегистрНакопления.ОтражениеВБухучете"+ИмяТаблицы);
			КонецЕсли;
			// ЗУПК
			
			Запрос.Текст = ТекстЗапроса;
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Выборка);
				КонецЦикла;
				ОтражениеЗарплатыВУчете.СвернутьТаблицу(Таблица);
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатьиФинансирования) Тогда
		
		Отбор = Новый Структура("СтатьяФинансирования");
		Для каждого ЭлементКоллекции Из РезультатЗаполнения Цикл
			// ЗУПК
			Если ВРег(ЭлементКоллекции.Ключ) = ВРег("РегламентированныеУдержания") 
				ИЛИ ВРег(ЭлементКоллекции.Ключ) = ВРег("ПеняПоВзносамИОтчислениям") Тогда
				Продолжить;
			КонецЕсли;
			// ЗУПК
			Таблица = ЭлементКоллекции.Значение;
			НоваяТаблица = Таблица.СкопироватьКолонки();
			Таблица.Индексы.Добавить("СтатьяФинансирования");
			Для каждого СтатьяФинансирования Из СтатьиФинансирования Цикл
				Отбор.СтатьяФинансирования = СтатьяФинансирования;
				НайденныеСтроки = Таблица.НайтиСтроки(Отбор);
				Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
					ЗаполнитьЗначенияСвойств(НоваяТаблица.Добавить(), СтрокаТЗ);
				КонецЦикла;
			КонецЦикла;
			РезультатЗаполнения[ЭлементКоллекции.Ключ] = НоваяТаблица;
		КонецЦикла;
		
	КонецЕсли;
	
	Подразделения = Неопределено;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Владелец = &Организация
		|	И ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&Подразделение)";
		Подразделения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Отбор = Новый Структура("Подразделение");
		
		НачисленнаяЗарплатаИВзносы = РезультатЗаполнения.НачисленнаяЗарплатаИВзносы;
		НачисленнаяЗарплатаИВзносы.Индексы.Добавить("Подразделение");
		НоваяТаблицаНачисленнаяЗарплатаИВзносы = НачисленнаяЗарплатаИВзносы.СкопироватьКолонки();
		
		УдержаннаяЗарплата = РезультатЗаполнения.УдержаннаяЗарплата;
		УдержаннаяЗарплата.Индексы.Добавить("Подразделение");
		НоваяТаблицаУдержаннаяЗарплата = УдержаннаяЗарплата.СкопироватьКолонки();
		
		// ЗУПК
		РегламентированныеУдержания = РезультатЗаполнения.РегламентированныеУдержания;
		РегламентированныеУдержания.Индексы.Добавить("Подразделение");
		НоваяТаблицаРегламентированныеУдержания = РегламентированныеУдержания.СкопироватьКолонки();
		
		ПеняПоВзносамИОтчислениям = РезультатЗаполнения.ПеняПоВзносамИОтчислениям;
		ПеняПоВзносамИОтчислениям.Индексы.Добавить("Подразделение");
		НоваяТаблицаПеняПоВзносамИОтчислениям = ПеняПоВзносамИОтчислениям.СкопироватьКолонки();
		// ЗУПК
		
		Для каждого ПодразделениеОтбора Из Подразделения Цикл
		
			Отбор.Подразделение = ПодразделениеОтбора;
			
			НайденныеСтроки = НачисленнаяЗарплатаИВзносы.НайтиСтроки(Отбор);
			Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(НоваяТаблицаНачисленнаяЗарплатаИВзносы.Добавить(), СтрокаТЗ);
			КонецЦикла;
			
			НайденныеСтроки = УдержаннаяЗарплата.НайтиСтроки(Отбор);
			Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(НоваяТаблицаУдержаннаяЗарплата.Добавить(), СтрокаТЗ);
			КонецЦикла;
		
			// ЗУПК
			НайденныеСтроки = РегламентированныеУдержания.НайтиСтроки(Отбор);
			Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(НоваяТаблицаРегламентированныеУдержания.Добавить(), СтрокаТЗ);
			КонецЦикла;
		
			НайденныеСтроки = ПеняПоВзносамИОтчислениям.НайтиСтроки(Отбор);
			Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(НоваяТаблицаПеняПоВзносамИОтчислениям.Добавить(), СтрокаТЗ);
			КонецЦикла;
			// ЗУПК
		
		КонецЦикла;
		
		РезультатЗаполнения.НачисленнаяЗарплатаИВзносы = НоваяТаблицаНачисленнаяЗарплатаИВзносы;
		РезультатЗаполнения.УдержаннаяЗарплата = НоваяТаблицаУдержаннаяЗарплата;
		// ЗУПК
		РезультатЗаполнения.РегламентированныеУдержания = НоваяТаблицаРегламентированныеУдержания;
		РезультатЗаполнения.ПеняПоВзносамИОтчислениям = НоваяТаблицаПеняПоВзносамИОтчислениям;
		// ЗУПК
		
		ОтборФизическиеЛица = ОбщегоНазначения.ВыгрузитьКолонку(НоваяТаблицаНачисленнаяЗарплатаИВзносы, "ФизическоеЛицо", Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОтборФизическиеЛица, ОбщегоНазначения.ВыгрузитьКолонку(НоваяТаблицаУдержаннаяЗарплата, "ФизическоеЛицо", Истина), Истина);
		
		СтрокиКУдалению = Новый Массив;
		Для каждого СтрокаТЗ Из РезультатЗаполнения.НачисленныйНДФЛ Цикл
			Если ОтборФизическиеЛица.Найти(СтрокаТЗ.ФизическоеЛицо) = Неопределено Тогда
				СтрокиКУдалению.Добавить(СтрокаТЗ);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			РезультатЗаполнения.НачисленныйНДФЛ.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		Если РезультатЗаполнения.ВыплатаЗаСчетРезерва.Количество() > 0 Тогда
			
			Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(РезультатЗаполнения.ВыплатаЗаСчетРезерва, "Сотрудник", Истина);
			СотрудникФизическиеЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники,"ФизическоеЛицо");
			
			СтрокиКУдалению = Новый Массив;
			Для каждого СтрокаТЗ Из РезультатЗаполнения.ВыплатаЗаСчетРезерва Цикл
				ФизическоеЛицо = СотрудникФизическиеЛица[СтрокаТЗ.Сотрудник];
				Если ОтборФизическиеЛица.Найти(ФизическоеЛицо) = Неопределено Тогда
					СтрокиКУдалению.Добавить(СтрокаТЗ);
				КонецЕсли;
			КонецЦикла;
			
			Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
				РезультатЗаполнения.ВыплатаЗаСчетРезерва.Удалить(СтрокаКУдалению);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ДанныеДляОтраженияРасчетовЗарплатыВБухучете);
	
	ФункциональныеОпции = Новый Массив;
	// ЗУПК
	ФункциональныеОпции.Добавить("РаботаВХозрасчетнойОрганизации");
	// ЗУПК
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДанныеДляОтраженияРасчетовЗарплатыВБухучете, "ОтражениеВБухучетеПоИсточникам");
	Вариант.ФункциональныеОпции = ФункциональныеОпции;
	
	ФункциональныеОпции = Новый Массив;
	// ЗУПК
	ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
	// ЗУПК
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДанныеДляОтраженияРасчетовЗарплатыВБухучете, "ОтражениеВБухучете");
	Вариант.ФункциональныеОпции = ФункциональныеОпции;
	
КонецПроцедуры

// Возвращает информацию о последнем периоде отражения зарплаты.
//
// Возвращаемое значение:
//  - Период - Дата - дата последнего периода отражения зарплаты.
//
Функция ПоследнийПериодОтраженияЗарплаты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.Период КАК Период
		|ПОМЕСТИТЬ ВТПериоды
		|ИЗ
		|	РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы КАК ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТПериоды.Период) КАК Период
		|ИЗ
		|	ВТПериоды КАК ВТПериоды";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Период;		
	
КонецФункции

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы", 		"Период", "БухгалтерскийУчетЗарплаты", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ОтражениеВБухучетеНачисленныйНДФЛ", 				"Период", "БухгалтерскийУчетЗарплаты", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ОтражениеВБухучетеУдержаннаяЗарплата", 				"Период", "БухгалтерскийУчетЗарплаты", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва", 	        "Период", "БухгалтерскийУчетЗарплаты", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ОтражениеВБухучетеУдержанныйНДФЛ", 					"Период", "БухгалтерскийУчетЗарплаты", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтражениеУдержанногоНДФЛВБухучете", 							"ПериодРегистрации", "БухгалтерскийУчетЗарплаты", "Организация");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОтражениеВБухучетеНачисленныйНДФЛ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОтражениеВБухучетеУдержаннаяЗарплата, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОтражениеВБухучетеУдержанныйНДФЛ, Истина);
	Списки.Вставить(Метаданные.Документы.ОтражениеУдержанногоНДФЛВБухучете, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтражениеУдержанногоНДФЛВБухучетеПрисоединенныеФайлы, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
		|РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.Чтение.ГруппыФизическихЛиц
		|РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.Чтение.Организации
		|РегистрНакопления.ОтражениеВБухучетеНачисленныйНДФЛ.Чтение.ГруппыФизическихЛиц
		|РегистрНакопления.ОтражениеВБухучетеНачисленныйНДФЛ.Чтение.Организации
		|РегистрНакопления.ОтражениеВБухучетеУдержаннаяЗарплата.Чтение.ГруппыФизическихЛиц
		|РегистрНакопления.ОтражениеВБухучетеУдержаннаяЗарплата.Чтение.Организации
		|РегистрНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва.Чтение.ГруппыФизическихЛиц
		|РегистрНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва.Чтение.Организации
		|Документ.ОтражениеУдержанногоНДФЛВБухучете.Чтение.Организации
		|Документ.ОтражениеУдержанногоНДФЛВБухучете.Изменение.Организации
		|РегистрНакопления.ОтражениеВБухучетеУдержанныйНДФЛ.Чтение.Организации
		|Справочник.ОтражениеУдержанногоНДФЛВБухучетеПрисоединенныеФайлы.Чтение.Организации
		|Справочник.ОтражениеУдержанногоНДФЛВБухучетеПрисоединенныеФайлы.Изменение.Организации";
	
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "06c3bf29-b3da-4f74-95ac-1f38f073a5c6", Метаданные.Документы.ОтражениеУдержанногоНДФЛВБухучете);
	
КонецПроцедуры

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ОтражениеУдержанногоНДФЛВБухучете);
	
КонецПроцедуры

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.100";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОтражениеРасчетовЗарплатыВБухучете.ЗаполнитьДвиженияОтражениеВБухучете";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b1dffa6e-5ab2-4136-bd63-287d441ad249");
	Обработчик.Комментарий = НСтр("ru = 'Обновление движений документов ""Отражение зарплаты в бухучете.""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.207";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Процедура = "ОтражениеРасчетовЗарплатыВБухучете.ОчиститьПоляРезервовПоОплатеТруда";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f6075236-26ea-4d35-a116-b7e86cd3f701");
	Обработчик.Комментарий = НСтр("ru = 'Очистка полей резервов в старых данных.'");
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияОтражениеВБухучете(ПараметрыОбновления = Неопределено) Экспорт
	
	ИмяДокумента = "";
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.БухучетХозрасчетныхОрганизаций")
		И ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда
		ИмяДокумента = "ОтражениеЗарплатыВБухучете";
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений")
		И ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		ИмяДокумента = "ОтражениеЗарплатыВБухучетеБюджетныхУчреждений";
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяДокумента) Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = "Документ."+ИмяДокумента;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.ПериодРегистрации КАК ПериодРегистрации
	|ПОМЕСТИТЬ ВТДокументы
	|ИЗ
	|	#ИмяТаблицы КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Ссылка КАК Ссылка,
	|	ТаблицаДокументов.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Документы.Ссылка КАК Ссылка,
	|		Документы.ПериодРегистрации КАК ПериодРегистрации
	|	ИЗ
	|		ВТДокументы КАК Документы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ИмяТабличнойЧастиНачисленнаяЗарплатаИВзносы КАК Таблица
	|			ПО Документы.Ссылка = Таблица.Ссылка) КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы КАК ТаблицаРегистра
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаРегистра.Регистратор
	|ГДЕ
	|	ТаблицаРегистра.НомерСтроки ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Документы.Ссылка КАК Ссылка,
	|		Документы.ПериодРегистрации КАК ПериодРегистрации
	|	ИЗ
	|		ВТДокументы КАК Документы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ИмяТабличнойЧастиНачисленныйНДФЛ КАК Таблица
	|			ПО Документы.Ссылка = Таблица.Ссылка) КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтражениеВБухучетеНачисленныйНДФЛ КАК ТаблицаРегистра
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаРегистра.Регистратор
	|ГДЕ
	|	ТаблицаРегистра.НомерСтроки ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Документы.Ссылка КАК Ссылка,
	|		Документы.ПериодРегистрации КАК ПериодРегистрации
	|	ИЗ
	|		ВТДокументы КАК Документы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ИмяТабличнойЧастиУдержаннаяЗарплата КАК Таблица
	|			ПО Документы.Ссылка = Таблица.Ссылка) КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтражениеВБухучетеУдержаннаяЗарплата КАК ТаблицаРегистра
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаРегистра.Регистратор
	|ГДЕ
	|	ТаблицаРегистра.НомерСтроки ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.Ссылка,
	|	ТаблицаДокументов.ПериодРегистрации
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Документы.Ссылка КАК Ссылка,
	|		Документы.ПериодРегистрации КАК ПериодРегистрации
	|	ИЗ
	|		ВТДокументы КАК Документы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ИмяТабличнойЧастиВыплатаЗаСчетРезерва КАК Таблица
	|			ПО Документы.Ссылка = Таблица.Ссылка) КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва КАК ТаблицаРегистра
	|		ПО ТаблицаДокументов.Ссылка = ТаблицаРегистра.Регистратор
	|ГДЕ
	|	ТаблицаРегистра.НомерСтроки ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодРегистрации УБЫВ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ИмяТаблицы", ИмяТаблицы);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ИмяТабличнойЧасти", ИмяТаблицы+".");
	
	РезультатЗапроса = Запрос.Выполнить();
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Регистратор = Выборка.Ссылка;
		ДокументОбъект = Регистратор.ПолучитьОбъект();
		
		Если ДокументОбъект.НачисленнаяЗарплатаИВзносы.Количество() > 0 Тогда
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
								"РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.НаборЗаписей",
								"Регистратор", Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			Для каждого СтрокаТЧ Из ДокументОбъект.НачисленнаяЗарплатаИВзносы Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ);
				НоваяЗапись.Организация = ДокументОбъект.Организация;
				НоваяЗапись.Период = ДокументОбъект.ПериодРегистрации;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЕсли;
		
		Если ДокументОбъект.НачисленныйНДФЛ.Количество() > 0 Тогда
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
								"РегистрНакопления.ОтражениеВБухучетеНачисленныйНДФЛ.НаборЗаписей",
								"Регистратор", Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыНакопления.ОтражениеВБухучетеНачисленныйНДФЛ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			Для каждого СтрокаТЧ Из ДокументОбъект.НачисленныйНДФЛ Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ);
				НоваяЗапись.Организация = ДокументОбъект.Организация;
				НоваяЗапись.Период = ДокументОбъект.ПериодРегистрации;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЕсли;
		
		Если ДокументОбъект.УдержаннаяЗарплата.Количество() > 0 Тогда
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
								"РегистрНакопления.ОтражениеВБухучетеУдержаннаяЗарплата.НаборЗаписей",
								"Регистратор", Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыНакопления.ОтражениеВБухучетеУдержаннаяЗарплата.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			Для каждого СтрокаТЧ Из ДокументОбъект.УдержаннаяЗарплата Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ);
				НоваяЗапись.Организация = ДокументОбъект.Организация;
				НоваяЗапись.Период = ДокументОбъект.ПериодРегистрации;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЕсли;
		
		Если ДокументОбъект.ВыплатаЗаСчетРезерва.Количество() > 0 Тогда
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
								"РегистрНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва.НаборЗаписей",
								"Регистратор", Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			
			Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(ДокументОбъект.ВыплатаЗаСчетРезерва, "Сотрудник", Истина);
			СотрудникФизическиеЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники,"ФизическоеЛицо");
			
			НаборЗаписей = РегистрыНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			Для каждого СтрокаТЧ Из ДокументОбъект.ВыплатаЗаСчетРезерва Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЧ);
				НоваяЗапись.Организация = ДокументОбъект.Организация;
				НоваяЗапись.Период = ДокументОбъект.ПериодРегистрации;
				НоваяЗапись.ФизическоеЛицо = СотрудникФизическиеЛица[НоваяЗапись.Сотрудник];
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьПоляРезервовПоОплатеТруда(ПараметрыОбновления = Неопределено) Экспорт

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры") Тогда
		МодульРезервыПоОплатеТруда = ОбщегоНазначения.ОбщийМодуль("РезервыПоОплатеТрудаРасширенный");
		МодульРезервыПоОплатеТруда.СоздатьВТНастройкиРасчетаРезервовОтпусков(МенеджерВТ);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Бухучет.Организация КАК Организация,
	|	Бухучет.Период КАК Период,
	|	ЛОЖЬ КАК ТаблицаРезервов
	|ПОМЕСТИТЬ ВТОрганизацииПериод
	|ИЗ
	|	РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы КАК Бухучет
	|ГДЕ
	|	(Бухучет.РезервБУ
	|			ИЛИ Бухучет.РезервНУ
	|			ИЛИ Бухучет.Резерв <> ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Резервы.Организация,
	|	Резервы.Период,
	|	ИСТИНА
	|ИЗ
	|	РегистрНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва КАК Резервы
	|ГДЕ
	|	(Резервы.РезервБУ
	|			ИЛИ Резервы.РезервНУ
	|			ИЛИ Резервы.Резерв <> ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПериод.Организация КАК Организация,
	|	ОрганизацииПериод.Период КАК Период,
	|	ОрганизацииПериод.ТаблицаРезервов КАК ТаблицаРезервов
	|ПОМЕСТИТЬ ВТОрганизацииПериодыКОбработке
	|ИЗ
	|	ВТОрганизацииПериод КАК ОрганизацииПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиРасчетаРезервовПоОплатеТруда КАК Настройки
	|		ПО ОрганизацииПериод.Организация = Настройки.Организация
	|			И (ОрганизацииПериод.Период МЕЖДУ Настройки.НачалоПериода И Настройки.КонецПериода)
	|ГДЕ
	|	Настройки.НачалоПериода ЕСТЬ NULL";
	Запрос.Выполнить();
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВТ, "ВТОрганизацииПериодыКОбработке") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Бухучет.Регистратор КАК Регистратор,
	|	Бухучет.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка) КАК Резерв,
	|	ЛОЖЬ КАК РезервБУ,
	|	ЛОЖЬ КАК РезервНУ,
	|	Бухучет.*
	|ИЗ
	|	РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы КАК Бухучет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииПериодыКОбработке КАК ОрганизацииПериоды
	|		ПО Бухучет.Организация = ОрганизацииПериоды.Организация
	|			И Бухучет.Период = ОрганизацииПериоды.Период
	|			И (НЕ ОрганизацииПериоды.ТаблицаРезервов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ОбработкаЗавершена = Истина;
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		
		Регистратор = Выборка.Регистратор;
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.НаборЗаписей", "Регистратор", Регистратор) Тогда
			ОбработкаЗавершена = Ложь;
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыНакопления.ОтражениеВБухучетеНачисленнаяЗарплатаИВзносы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Резервы.Регистратор КАК Регистратор,
	|	Резервы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка) КАК Резерв,
	|	ЛОЖЬ КАК РезервБУ,
	|	ЛОЖЬ КАК РезервНУ,
	|	Резервы.*
	|ИЗ
	|	РегистрНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва КАК Резервы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииПериодыКОбработке КАК ОрганизацииПериоды
	|		ПО Резервы.Организация = ОрганизацииПериоды.Организация
	|			И Резервы.Период = ОрганизацииПериоды.Период
	|			И (ОрганизацииПериоды.ТаблицаРезервов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		
		Регистратор = Выборка.Регистратор;
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва.НаборЗаписей", "Регистратор", Регистратор) Тогда
			ОбработкаЗавершена = Ложь;
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыНакопления.ОтражениеВБухучетеВыплатаЗаСчетРезерва.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбработкаЗавершена);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
